/***************************************************************************/
#ifdef MYLIBAPI
// MYLIBAPI должен быть определен во всех модулях исходного кода DLL
// до включения этого файла
// здесь размещаются все экспортируемые функции и переменные
#else
// этот заголовочный файл включается в исходный код EXE-файла;
// указываем, что все функции и переменные импортируются
#define MYLIBAPI extern __declspec(dllimport)
#endif
////////////////////////////////////////////////////////////////////////////
// здесь определяются все структуры данных и идентификаторы (символы)
////////////////////////////////////////////////////////////////////////////
// Здесь определяются экспортируемые переменные.
// Примечание: избегайте экспорта переменных.
MYLIBAPI int g_nResult;
////////////////////////////////////////////////////////////////////////////
// здесь определяются прототипы экспортируемых функций
MYLIBAPI int Add(int nLeft, int nRight);
////////////////////////////// Конец файла /////////////////////////////////