/***************************************************************************
Модуль: MyLib.c
***************************************************************************/
// сюда включаются стандартные заголовочные файлы Windows и библиотеки C
#include <windows.h>
// этот файл исходного кода DLL экспортирует функции и переменные
#define MYLIBAPI extern __declspec(dllexport)
// включаем экспортируемые структуры данных, идентификаторы, функции и
// переменные
#include "MyLib.h"
////////////////////////////////////////////////////////////////////////////
// здесь размещается исходный код этой DLL
int g_nResult;
int Add(int nLeft, int nRight) {
  g_nResult = nLeft + nRight;
  return (g_nResult);
}
////////////////////////////// Конец файла ////////////////////////////////